Revit 2024 API
LinearArray.Create Method
Overload List
Name | Description
Create(Document, View, ElementId, Int32, XYZ, ArrayAnchorMember)
 Creates a new linear array element from a single element.
Create(Document, View, ICollection<ElementId>, Int32, XYZ, ArrayAnchorMember)
 Creates a new linear array element from a set of elements.
See Also
LinearArray Class
LinearArray Members
Autodesk.Revit.DB Namespace